In [5]:
import pandas as pd

data1 = {"col1": ['a','b','c'],
        "col2": [1,2,3]}
data2 = {"col3": ['a','b','f'],
        "col4": [10,20,30]}

In [11]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

  col1  col2
0    a     1
1    b     2
2    c     3

In [21]:
pd.merge(df1,df2, left_on ='col1', right_on='col3', how = 'outer')

  col1  col2 col3  col4
0    a   1.0    a  10.0
1    b   2.0    b  20.0
2    c   3.0  NaN   NaN
3  NaN   NaN    f  30.0

In [25]:
data3 = {
    "col1": [1,2,3],
    "col2": [1,2,3]
}
df3 = pd.DataFrame(data3)
df3.apply(lambda row: row['col1'] + row['col2'], axis="columns")

0    2
1    4
2    6
dtype: int64

In [28]:
data4 = {
    "names": ['철수','영희','민수'],
    "score": [76,45,67]
}
data5={
    "names": ['경원','도연','창수'],
    "score": [23,100,87]
}
df4 = pd.DataFrame(data4)
df5 = pd.DataFrame(data5)
pd.concat([df4,df5], ignore_index=True)

  names  score
0    철수     76
1    영희     45
2    민수     67
3    경원     23
4    도연    100
5    창수     87

In [29]:
pd.concat([df4,df5], axis=1)

  names  score names  score
0    철수     76    경원     23
1    영희     45    도연    100
2    민수     67    창수     87

In [33]:
pd.concat([df4,df5], axis=1, join='inner')

  names  score names  score
0    철수     76    경원     23
1    영희     45    도연    100
2    민수     67    창수     87